Revit 2024 API
ParameterTypeId.StairstypeLeftSideSupportType Property
 "Left Support Type": Left Side Support Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairstypeLeftSideSupportType { get; }
Visual Basic
Public Shared ReadOnly Property StairstypeLeftSideSupportType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairstypeLeftSideSupportType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace